{
    "Apple___Apple_scab": "Fungicides such as copper-based fungicides, sulfur, or systemic fungicides. Remove infected leaves in spring.",
    "Apple___Black_rot": "Remove and destroy infected fruit and leaves, apply fungicides, and ensure proper air circulation around the trees.",
    "Apple___Cedar_apple_rust": "Use resistant apple varieties, remove infected plant material, and apply fungicides like myclobutanil or sulfur.",
    "Apple___healthy": "Regular maintenance and pest control.",
    "Blueberry___healthy": "Maintain good plant hygiene, ensure proper irrigation and nutrient management.",
    "Cherry_(including_sour)___Powdery_mildew": "Apply fungicides such as neem oil, sulfur, or potassium bicarbonate, and prune infected parts.",
    "Cherry_(including_sour)___healthy": "Regular care, proper spacing to improve airflow.",
    "Corn_(maize)___Cercospora_leaf_spot Gray_leaf_spot": "Apply fungicides such as chlorothalonil or pyraclostrobin, rotate crops to prevent recurrence.",
    "Corn_(maize)___Common_rust_": "Apply fungicides like azoxystrobin or chlorothalonil, rotate crops.",
    "Corn_(maize)___Northern_Leaf_Blight": "Apply fungicides like propiconazole, rotate crops, and remove infected plant debris.",
    "Corn_(maize)___healthy": "Proper irrigation, nitrogen management, and pest control.",
    "Grape___Black_rot": "Apply copper-based fungicides or systemic fungicides, remove and dispose of infected fruit and leaves.",
    "Grape___Esca_(Black_Measles)": "There’s no cure; remove infected vines and avoid injuries to the vine.",
    "Grape___Leaf_blight_(Isariopsis_Leaf_Spot)": "Apply fungicides like sulfur or copper, ensure proper pruning and air circulation.",
    "Grape___healthy": "Proper trellising, pest control, and monitoring for diseases.",
    "Orange___Haunglongbing_(Citrus_greening)": "No cure; remove infected trees to prevent spread, maintain healthy soil, and use systemic insecticides to control vector insects (Asian citrus psyllid).",
    "Peach___Bacterial_spot": "Apply copper-based fungicides or streptomycin for bacterial control, remove infected fruit and leaves, and practice good sanitation.",
    "Peach___healthy": "Regular maintenance, proper irrigation, and pruning.",
    "Pepper,_bell___Bacterial_spot": "Use copper-based fungicides, ensure proper spacing and sanitation.",
    "Pepper,_bell___healthy": "Use resistant varieties and ensure optimal growing conditions.",
    "Potato___Early_blight": "Apply fungicides like chlorothalonil, rotate crops, and ensure proper spacing for air circulation.",
    "Potato___Late_blight": "Use fungicides like metalaxyl or chlorothalonil, remove infected plants immediately, and practice crop rotation.",
    "Potato___healthy": "Regular care, pest management, and ensure well-drained soil.",
    "Raspberry___healthy": "Keep the plants clean, prune regularly, and ensure proper water and nutrient levels.",
    "Soybean___healthy": "Keep the fields free from weeds, manage soil nutrients properly, and monitor for pests.",
    "Squash___Powdery_mildew": "Apply fungicides like sulfur, neem oil, or potassium bicarbonate. Remove infected leaves and improve airflow.",
    "Strawberry___Leaf_scorch": "Ensure proper watering, mulching, and pest control.",
    "Strawberry___healthy": "Apply fungicides like sulfur or copper, prune affected parts, and ensure proper watering practices.",
    "Tomato___Bacterial_spot": "Regular care, optimal sun exposure, and pest control.",
    "Tomato___Early_blight": "Apply copper-based fungicides, prune infected leaves, and practice good sanitation.",
    "Tomato___Late_blight": "Use fungicides such as chlorothalonil or copper, ensure proper spacing, and rotate crops.",
    "Tomato___Leaf_Mold": "Apply fungicides like mancozeb or chlorothalonil, and remove infected plant material.",
    "Tomato___Septoria_leaf_spot": "Apply fungicides like chlorothalonil, and ensure proper airflow.",
    "Tomato___Spider_mites Two-spotted_spider_mite": "Use fungicides like chlorothalonil or mancozeb, remove infected leaves, and avoid overhead irrigation.",
    "Tomato___Target_Spot": "Apply insecticidal soap or neem oil, keep plants well-watered, and introduce natural predators.",
    "Tomato___Tomato_Yellow_Leaf_Curl_Virus": "Use fungicides like chlorothalonil or copper, and rotate crops.",
    "Tomato___Tomato_mosaic_virus": "Remove infected plants, control whiteflies (the virus vector) with insecticides or by using reflective mulches.",
    "Tomato___healthy": "Remove and destroy infected plants, prevent transmission by controlling aphids."
}